{
  "__comment__": "This file was automatically created by mcresources",
  "name": "Sewing Table",
  "category": "tfc:mechanics",
  "icon": "tfc:wood/sewing_table/oak",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "The $(thing)Sewing Table$() is used to produce banner patterns and smithing templates. It requires $(l:mechanics/weaving#wool_cloth)Wool Cloth$(), $(l:mechanics/weaving#burlap_cloth)Burlap Cloth$(), String or Yarn, as well as a Needle."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "tfc:crafting/bone_needle",
      "text": "A needle for sewing can be made from a bone."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "tfc:crafting/wood/sewing_table/oak",
      "text": "The sewing table can be made from wood, leather, and a pair of shears."
    },
    {
      "type": "patchouli:text",
      "text": "The sewing table's inventory is similar to that of a crafting table. If you ever make a mistake, you can simply exit the inventory, and your items will be returned to you. There is a recipe book available in the GUI. Selecting the book opens a menu where you can select a recipe. This places small indicators of what steps to perform on the working surface."
    },
    {
      "type": "patchouli:image",
      "images": [
        "tfc:textures/gui/book/gui/sewing_table.png"
      ],
      "text": "The sewing screen.",
      "border": true
    },
    {
      "type": "patchouli:text",
      "text": "The slots on the left are for the string and the needle. The two bottom slots can hold any combination of burlap and wool cloth. The slot on the right will show the result when it is ready to be taken. Taking the result from the result slot completes the craft, and uses the items."
    },
    {
      "type": "patchouli:text",
      "text": "Each cloth item allows placing 8 squares of that material on the sewing surface. Similarly, each yarn item allows placing 16 stitches. When you have selected a recipe, just use the buttons on the top right of the screen to place squares and stitch them together as shown by the guide. Want to remove stitches? Use the red 'X' button to get rid of squares."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "tfc:crafting/vanilla/loom",
      "text": "The banner loom, for making things with banner patterns, can be crafted to do work with banner patterns."
    },
    {
      "type": "patchouli:text",
      "text": "For information on the use of smithing templates, see the $(l:mechanics/armor_trims)Armor Trims$() chapter."
    }
  ],
  "read_by_default": true
}