{
  "__comment__": "This file was automatically created by mcresources",
  "name": "Introduction",
  "category": "tfc:getting_started",
  "icon": "tfc:rock/loose/granite",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "In TerraFirmaCraft, the first things you can obtain are sticks, twigs, and loose rocks. They can be found in almost every climate, lying scattered on the ground. $(item)$(k:key.use)$() or break these to pick them up."
    },
    {
      "type": "patchouli:multiblock",
      "multiblock": {
        "pattern": [
          [
            "1    ",
            " 2  4",
            "  03 ",
            " 4   ",
            "    5"
          ],
          [
            "GGGGG",
            "GGGGG",
            "GGGGG",
            "GGGGG",
            "GGGGG"
          ]
        ],
        "mapping": {
          "G": "tfc:grass/sandy_loam",
          "1": "tfc:rock/loose/granite[count=1]",
          "2": "tfc:rock/loose/granite[count=2]",
          "3": "tfc:rock/loose/granite[count=3]",
          "4": "tfc:groundcover/stick",
          "5": "tfc:wood/twig/ash"
        }
      },
      "name": "Example",
      "text": "A smattering of common sticks and stones.",
      "enable_visualize": false
    },
    {
      "type": "patchouli:text",
      "text": "In addition to gathering sticks and twigs on the ground, sticks can also be obtained by breaking leaves with your fist. Once you have a number of rocks and sticks, you are ready to start $(thing)Knapping$(). Knapping is a process where two rocks are hit together, to form a particular shape. In order to knap, first hold at least two rocks in your hand, then right click in the air, which will open up the $(thing)Knapping Interface$()."
    },
    {
      "type": "patchouli:image",
      "images": [
        "tfc:textures/gui/book/gui/rock_knapping.png"
      ],
      "text": "The Knapping Interface.",
      "border": false
    },
    {
      "type": "patchouli:text",
      "text": "In order to knap a particular item, you want to remove squares until you form the desired pattern. For example, create a knife blade by matching the recipe shown to the right.$(br2)Like crafting recipes, the location of the desired pattern doesn't matter for the output, and some recipes have multiple variants that are valid."
    },
    {
      "type": "tfc:rock_knapping_recipe",
      "recipes": [
        "tfc:rock_knapping/knife_head_sedimentary",
        "tfc:rock_knapping/knife_head_metamorphic",
        "tfc:rock_knapping/knife_head_igneous_extrusive",
        "tfc:rock_knapping/knife_head_igneous_intrusive"
      ],
      "text": "A knife blade, crafted from several different rock types."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "tfc:crafting/stone/knife_sedimentary",
      "text": "Once you have obtained a knife blade, in order to create a stone knife, simply craft it with a stick in your inventory."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "tfc:crafting/wood/stick_from_twigs",
      "text": "The twigs from earlier can also be used to create sticks, if needed."
    },
    {
      "type": "patchouli:spotlight",
      "item": "tfc:stone/knife/sedimentary",
      "link_recipes": false,
      "text": "Knives are a very useful tool. One of their primary uses is to collect straw by breaking plants. Most tall grasses and plants will drop straw when broken with a knife."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "tfc:crafting/thatch",
      "text": "Straw can be used to craft one of the first building materials: $(thing)thatch$(). Thatch is a lightweight block that isn't affected by gravity, however players and other entities can pass right through it!"
    },
    {
      "type": "patchouli:text",
      "text": "In addition to knives, you will likely want to craft a couple other tools. $(thing)Axes$() can be used to chop down trees (finally!), and also make a useful weapon. $(thing)Hammers$() can be used as a crushing weapon, but can also be used to turn logs into sticks, by breaking log blocks with the hammer."
    },
    {
      "type": "patchouli:text",
      "text": "Finally, $(thing)Shovels$() and $(thing)Hoes$() behave the same as they do in Vanilla, and $(thing)Javelins$() can be used as a simple toss-once-and-retrieve ranged weapon."
    }
  ],
  "read_by_default": true,
  "sortnum": 0
}