{
  "__comment__": "This file was automatically created by mcresources",
  "name": "Pottery",
  "category": "tfc:getting_started",
  "icon": "tfc:ceramic/vessel",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "$(thing)Clay$() is an incredibly useful and balanced material, which can be used for pottery. However first, it needs to be located. Clay is usually hidden by grass, but it is found often in two locations. In areas with of at least 175mm $(l:the_world/climate#rainfall)Annual Rainfall$(), clay can be found in patches all over the place, however these patches are usually marked the by presence of certain $(thing)Plants$()."
    },
    {
      "type": "patchouli:multiblock",
      "multiblock": {
        "pattern": [
          [
            "   ",
            " C ",
            "   "
          ],
          [
            "XXX",
            "X0X",
            "XXX"
          ]
        ],
        "mapping": {
          "0": "tfc:clay_grass/sandy_loam",
          "X": "tfc:clay_grass/sandy_loam",
          "C": "#tfc:clay_indicators"
        }
      },
      "name": "Clay Indicators",
      "text": "A clay indicator plant found atop some clay grass",
      "enable_visualize": false
    },
    {
      "type": "patchouli:text",
      "text": "Additionally, clay can be found in smaller deposits close to water sources, such as rivers, lakes, or ponds."
    },
    {
      "type": "patchouli:empty"
    },
    {
      "type": "patchouli:text",
      "text": "Like with rocks, clay can be knapped into different shapes. It requires five clay in your hand to knap. Unlike rocks, if you make a mistake, you can simply close the knapping interface, reshape your clay, and try again."
    },
    {
      "type": "patchouli:image",
      "images": [
        "tfc:textures/gui/book/gui/clay_knapping.png"
      ],
      "text": "The Knapping Interface.",
      "border": false
    },
    {
      "type": "patchouli:text",
      "text": "In order to survive and progress in the world of TFC, you need things that can't just be made out of sticks, rocks, and grass. This is where $(thing)pottery$() comes in. Dig up some clay with a shovel, or just your fists. Hold at least 5 clay in your hand and right-click, and a $(thing)knapping$() interface will show up, just like it did for stone.$(br2)One such pottery item is a $(thing)Small Vesel$()."
    },
    {
      "type": "patchouli:clay_knapping_recipe",
      "recipe": "tfc:clay_knapping/vessel",
      "text": "This is a item that can hold four other stacks in it's inventory. However in order to use, it must first be $(thing)fired$()."
    },
    {
      "type": "patchouli:text",
      "text": "In order to fire your clay items, you'll have to build a $(thing)pit kiln$(). This is very easy! First, dig a one block hole in the ground. Then, press V to place your unfired clay items in the hole, one by one. Then, right-click with 8 $(thing)straw$() and then 8 $(thing)logs$() to fill it, before lighting it with a $(thing)firestarter$()."
    }
  ],
  "read_by_default": true,
  "sortnum": 3
}