{
  "__comment__": "This file was automatically created by mcresources",
  "name": "Біоми",
  "category": "tfc:the_world",
  "icon": "tfc:textures/gui/book/icons/biomes.png",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "Світ складається з $(thing),біомів$(). Біоми визначають форму ландшафту, гірські породи та деякі інші особливості. Є кілька різних типів біомів для дослідження, включаючи океани, річкові каньйони, рівнини, пагорби та гори."
    },
    {
      "type": "patchouli:text",
      "text": "Наступні кілька сторінок показують кілька (але не всі) біомів, які ви можете знайти у світі."
    },
    {
      "type": "patchouli:text",
      "text": "Рівнини – це біом на низькій висоті, схожий на пагорби, трохи вище рівня моря. Він пологий, може містити поля трав і квітів, або може бути лісовим.",
      "title": "Рівнини"
    },
    {
      "type": "patchouli:image",
      "anchor": "plains",
      "images": [
        "tfc:textures/gui/book/biomes/plains.png"
      ],
      "text": "Рівнини.",
      "border": true
    },
    {
      "type": "patchouli:text",
      "anchor": "hills",
      "text": "Пагорби та хвилясті пагорби – це біоми від низької до середньої висоти, які часто межують з рівнинами або високогірними регіонами. Тут можна зустріти великі валуни, рідко — порожні залишки вулканічних гарячих джерел.",
      "title": "Пагорби та хвилясті пагорби"
    },
    {
      "type": "patchouli:image",
      "images": [
        "tfc:textures/gui/book/biomes/rolling_hills_with_river.png"
      ],
      "text": "Хвилясті пагорби, між якими тече річка.",
      "border": true
    },
    {
      "type": "patchouli:text",
      "anchor": "badlands",
      "text": "Безплодні землі — це континентальний біом на середній висоті, який часто зустрічається поблизу плато, гір або пагорбів. Поширені гряди з прошарками піску та пісковику. Типи піску різняться, а степи можуть бути або червоно-коричневими, або жовто-білими, або десь посередині.",
      "title": "Безплодні землі"
    },
    {
      "type": "patchouli:image",
      "images": [
        "tfc:textures/gui/book/biomes/badlands.png"
      ],
      "text": "Безплодні землі.",
      "border": true
    },
    {
      "type": "patchouli:text",
      "anchor": "plateau",
      "text": "Плато — це високогірний континентальний біом. Він схожий на рівнини, але на більшій висоті - рівні трав'янисті ділянки. На плато часто розкидані валуни, а сухі або порожні гарячі джерела можна спостерігати тут час від часу.",
      "title": "Плато"
    },
    {
      "type": "patchouli:image",
      "images": [
        "tfc:textures/gui/book/biomes/plateau.png"
      ],
      "text": "Плато, через яке протікає глибока річка.",
      "border": true
    },
    {
      "type": "patchouli:text",
      "anchor": "mountains",
      "text": "У високогірних районах можна зустріти кілька типів гір. Старі гори нижчі та пологіші ніж молодші, що тягнуться у висоту крутими скелями. Гори, утворені в районах високої тектонічної активності, також можуть генерувати гарячі джерела та рідкісні вулкани.",
      "title": "Гори"
    },
    {
      "type": "patchouli:image",
      "images": [
        "tfc:textures/gui/book/biomes/old_mountains.png"
      ],
      "text": "Старі гори з гарячими джерелами на засніжених схилах.",
      "border": true
    },
    {
      "type": "patchouli:text",
      "anchor": "lowlands",
      "text": "У середовищі, протилежному до високих гір, низовина може виглядати як болотистий, заповнений водою біом. На рівні моря або нижче, з великою кількістю прісної води, вони також можуть містити мул і багато рослинності.",
      "title": "Низовина́"
    },
    {
      "type": "patchouli:image",
      "images": [
        "tfc:textures/gui/book/biomes/lowlands.png"
      ],
      "text": "Низовина́.",
      "border": true
    },
    {
      "type": "patchouli:text",
      "anchor": "low_canyons",
      "text": "Низькі каньйони — ще один низький континентальний біом, який часто зустрічається на межі океанів або інших низьких біомів. Це помірно горбиста місцевість з частими звивистими ставками. Він схожий на геологічний щит, і тут можуть з'являтися порожні недіючі гарячі джерела.",
      "title": "Низькі каньйони"
    },
    {
      "type": "patchouli:image",
      "images": [
        "tfc:textures/gui/book/biomes/low_canyons.png"
      ],
      "text": "Низькі каньйони.",
      "border": true
    },
    {
      "type": "patchouli:text",
      "anchor": "canyons",
      "text": "Подібно до $(l:the_world/biomes#low_canyons)Низьких каньйонів$(), Каньйони – це континентальний біом на середній висоті з помірними пагорбами та частими звивистими ставками й озерами. Це дуже геологічно активна територія з частими малими і великими вулканами, валунами та діючими гарячими джерелами.",
      "title": "Каньйони"
    },
    {
      "type": "patchouli:image",
      "images": [
        "tfc:textures/gui/book/biomes/canyons.png"
      ],
      "text": "Каньйони з вулканами.",
      "border": true
    },
    {
      "type": "patchouli:text",
      "anchor": "ocean",
      "text": "Величезні океани TerraFirmaCraft відокремлюють континенти один від одного. Океани — це великі невиразні простори води, але під поверхнею можна знайти різні рослини, морських істот і водорості. У більш холодному кліматі океанами можуть плавати високі айсберги та морські крижини.",
      "title": "Океани"
    },
    {
      "type": "patchouli:image",
      "images": [
        "tfc:textures/gui/book/biomes/ocean.png"
      ],
      "text": "Океан, вигляд з узбережжя.",
      "border": true
    }
  ],
  "read_by_default": true,
  "sortnum": 0
}