{
  "__comment__": "This file was automatically created by mcresources",
  "name": "A First Look",
  "category": "tfc:the_world",
  "icon": "tfc:grass/loam",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "At first glance, the world of TerraFirmaCraft might seem like vanilla Minecraft, but don't let that fool you, nearly everything has changed, from the blocks on the ground. On the surface, you might find one of many different biomes, find yourself in one of many different climates, each with their own flora, fauna, and other decoration. Everything from the grass under your feet to the leaves on the trees to the ores in the ground has changed."
    },
    {
      "type": "patchouli:text",
      "text": "First, the dirt and grass under your feet might be one of a few different types of soil. Sand, loam, silt, or some in-between shades might appear based on the climate or biome of the region. In addition to normal dirt and grass, clay dirt and clay grass will also be scattered around the world, in addition to peat soil and peat grass in specific $(thing)climates$()."
    },
    {
      "type": "patchouli:text",
      "text": "Most of the blocks under your feet are also affected by some form of $(thing)gravity$(). Dirt, gravel, sand, and other loose soils will not only fall downwards, but they will fall down slopes if they are stacked too tall without support. Harder materials such as raw stone does not collapse immediately, but be wary of mining in unsupported areas, as raw stone can collapse with destructive force, putting any careless miner's life in danger"
    },
    {
      "type": "patchouli:text",
      "text": "On top of the dirt and grass, you can find over one hundred different plants, from the $(thing)athyrium fern$() to the $(thing)yucca$(). Some of these plants serve as special indicators of different resources, and can indicate the presence of clay, or fresh water nearby. Others can be used for decoration, or dyes. And almost all plants can be harvested for straw, which has many uses."
    },
    {
      "type": "patchouli:text",
      "text": "Perhaps most importantly in TerraFirmaCraft, is to look up to the sky. The natural world has a climate, and a yearly calendar. New worlds are created in June, but as the winter months approach, the temperature will gradually drop, the weather will get colder and snowier, and plants will die or retreat until next spring, when they will start flowering again. However, in addition to the seasons passing, different regions have different climates based on their latitude and longitude. This affects the average $(thing)temperature$() and $(thing)rainfall$() of an area, which will affect what flora and fauna is found there."
    }
  ],
  "sortnum": 0
}