{
  "__comment__": "This file was automatically created by mcresources",
  "name": "Наковальни",
  "category": "tfc:mechanics",
  "icon": "tfc:metal/anvil/copper",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "Наковальни являются важным инструментом, необходимым для металлообработки, поскольку они позволяют вам обрабатывать и сваривать металлические слитки в различные формы.$(br2)Наковальни полезны как для $(l:mechanics/anvils#working)Обработки$(), которая используется для превращения одного куска металла в другой, так и для $(l:mechanics/anvils#welding)сварки$(), которая используется для слияния двух металлических предметов в один цельный кусок."
    },
    {
      "type": "patchouli:multiblock",
      "multiblock": {
        "pattern": [
          [
            "X"
          ],
          [
            "0"
          ]
        ],
        "mapping": {
          "X": "#tfc:anvils"
        }
      },
      "name": "",
      "text": "Все типы металлических наковален.",
      "enable_visualize": false
    },
    {
      "type": "patchouli:crafting",
      "recipe": "tfc:crafting/metal/anvil/copper",
      "text": "Наковальни можно изготовить из $(thing)Двойных слитков$() соответствующего металла. Для вашей первой наковальни вы должны $(l:mechanics/anvils#welding)сварить$() двойные слитки сначала на $(l:getting_started/primitive_anvils)Каменной наковальне$()."
    },
    {
      "type": "patchouli:text",
      "anchor": "tiers",
      "text": "У каждой наковальни есть $(thing)Уровень$(), который определяет, с какими типами материалов она может работать и сваривать. Наковальня может обрабатывать металлы своего текущего уровня, и она может сваривать металлы, которые на один уровень выше.$(br)$(li)$(bold)Уровень 0$(): Каменные наковальни$(li)$(bold)Уровень I$(): медь$(li)$(bold)Уровень II$(): Висмутовая бронза, Черная бронза, Бронза$(li)$(bold)Уровень III$(): Кованое железо$(li)$(bold)Уровень IV$(): Сталь$(li)$(bold)Уровень V$(): Черная сталь$(li)$(bold)Уровень VI$(): Красная сталь, Синяя сталь"
    },
    {
      "type": "patchouli:text",
      "anchor": "working",
      "text": "Для работы с предметом на наковальне вам нужно будет использовать наковальню, чтобы открыть интерфейс наковальни, видимый справа. Слева есть два слота для предметов - для обработки целевой предмет должен находиться в правом слоте. Вам также понадобится молоток при работе, либо в слоте для молотка справа от наковальни, $(bold)или$() в вашей основной руке. Молоток будет постепенно изнашиваться по мере работы с предметом.",
      "title": "Обработка"
    },
    {
      "type": "patchouli:image",
      "images": [
        "tfc:textures/gui/book/gui/anvil_empty.png"
      ],
      "text": "Интерфейс наковальни.",
      "border": false
    },
    {
      "type": "patchouli:text",
      "text": "Затем вам нужно будет выбрать $(thing)План$(), который определяет, какой предмет вы хотите создать. $(item)$(k:key.attack)$() на кнопке прокрутки, а затем выберите один из предметов для создания. Интерфейс наковальни вернется, но теперь вы выбрали план - на прокрутке будет показан предмет, который вы собираетесь создать, и $(thing)Правила$() и $(thing)Цель$() теперь будут заполнены."
    },
    {
      "type": "patchouli:image",
      "images": [
        "tfc:textures/gui/book/gui/anvil_in_use.png"
      ],
      "text": "После выбора создания кирки.",
      "border": false
    },
    {
      "type": "patchouli:text",
      "text": "В середине экрана наковальни есть полоса с двумя цветными индикаторами. $(2)Зеленый$() указатель - это ваш текущий прогресс работы. $(4)Красный$() указатель - это цель. Ваша задача - совместить текущий прогресс с целью.$(br2)Для этого вы можете использовать $(2)зеленые$() и $(4)красные$() кнопки действий, которые перемещают ваш текущий прогресс на определенное количество, в зависимости от предпринятого действия.",
      "title": "Цели"
    },
    {
      "type": "patchouli:text",
      "text": "$(2)Зеленые$() действия всегда перемещают вашу цель $(bold)вправо$(), а $(4)Красные$() действия всегда перемещают ваш прогресс $(bold)влево$(). Обратите внимание, что если вы переместите вашу цель за пределы полосы прогресса, вы переработаете ваш предмет - вы потеряете слиток. Однако, во время работы, вы также должны соответствовать $(thing)правилам$()..."
    },
    {
      "type": "patchouli:text",
      "text": "$(thing)Правила$(), это два или три значка, показанных в верхней части интерфейса наковальни. Они представляют конкретные действия, которые должны быть выполнены в определенное время, чтобы ваша работа была успешной. Например, правило может быть $(2)Согнуть предпоследним$(), что означает, что предпоследнее действие, которое вы предпринимаете, $(bold)должно$() быть действием $(2)Сгибания$().",
      "title": "Правила обработки"
    },
    {
      "type": "patchouli:text",
      "text": "Ваши последние три действия показаны прямо под правилами. Когда правило удовлетворено, его контур изменится на зеленый. Успех наступает, когда все правила удовлетворены.$(br2)Наконец, вы должны учитывать $(l:mechanics/heating)температуру$() вашего предмета. Металлы можно обрабатывать только тогда, когда они нагреты до определенной температуры, когда в подсказке показано \"Можно обрабатывать\". Вы можете вынуть предмет и снова нагреть его в процессе работы."
    },
    {
      "type": "patchouli:text",
      "text": "Обработка может быть утомительной и требовать множества шагов для правильного выполнения. Однако за эффективность предусмотрена награда. Некоторые предметы, такие как головки инструментов, при обработке с минимальным или низким количеством шагов, получают бонус ковки в зависимости от того, насколько эффективно они были выкованы. Этот бонус затем применяется к инструментам, для которых используется данный предмет, например, головка кирки, используемая для изготовления кирки.",
      "title": "Бонусы ковки"
    },
    {
      "type": "patchouli:spotlight",
      "item": "tfc:metal/pickaxe/wrought_iron{\"tfc:forging_bonus\":4}",
      "title": "Идеально выковано",
      "link_recipes": false,
      "text": "Существует четыре уровня бонуса ковки: $(li)Плохо выковано$(li)Хорошо выковано$(li)Мастерски выковано$(li)Идеально выковано$(br2)Эти бонусы увеличивают мощность вашего инструмента - делая его менее ломким, добывающим быстрее и/или наносящим больше урона в бою, в зависимости от инструмента."
    },
    {
      "type": "patchouli:text",
      "anchor": "welding",
      "text": "Сварка - это процесс, при котором два предмета сливаются вместе, создавая новый предмет. Сварка работает одинаково как на $(l:getting_started/primitive_anvils)каменной наковальне$(), так и на металлической наковальне.$(br2)Сначала вы должны поместить два предмета, которые хотите сварить, на наковальню. Это можно сделать либо, используя предметы на наковальне, либо открыв интерфейс наковальни и вставив их в два крайних левых слота.",
      "title": "Сварка"
    },
    {
      "type": "patchouli:text",
      "text": "Вам также понадобится как минимум один $(l:mechanics/flux)флюс$() на наковальне для помощи в процессе сварки. Затем, когда оба предмета $(l:mechanics/heating)достаточно нагреты$() для сварки - в подсказке будет сказано \"Можно сваривать\" - вам нужно будет использовать любой $(thing)Молоток$() на наковальне. Вы услышите звук молотка, и предметы будут сварены вместе. Затем их можно извлечь, используя $(item)$(k:key.use)$() на наковальне с пустой рукой."
    }
  ],
  "read_by_default": true,
  "extra_recipe_mappings": {
    "tag:tfc:anvils": 0
  }
}