{
  "__comment__": "This file was automatically created by mcresources",
  "name": "Доменная печь",
  "category": "tfc:mechanics",
  "icon": "tfc:blast_furnace",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "$(thing)Доменная печь$() — это продвинутая установка, используемая для создания $(thing)Стали$(). Смешивая $(thing)Железные руды$(), $(thing)Древесный уголь$() и $(thing)флюс$() в контролируемой горячей среде, вы можете создать металл, прочнее чугуна или кованого железа.$(br2)Чтобы получить доменную печь, вам сначала понадобится $(l:mechanics/crucible)Тигель$() и много $(thing)Кованых железных листов$()."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "tfc:crafting/blast_furnace",
      "text": "Для создания структуры доменной печи потребуется $(thing)Тигель$(), а также нескольких $(thing)Кованых железных листов$()."
    },
    {
      "type": "patchouli:text",
      "text": "Затем вам нужно будет построить доменную печь вместе с ее $(thing)Дымоходом$(). Дымоход должен быть составлен из $(l:mechanics/fire_clay#fire_bricks)Огнеупорных кирпичей$(), так как они достаточно прочны, чтобы выдержать интенсивный жар. Затем его следует выложить $(thing)Коваными железными листами$() для дополнительного укрепления. При желании, листы могут быть изготовлены из более прочных металлов, такие как $(thing)Сталь$()."
    },
    {
      "type": "patchouli:multiblock",
      "multiblock_id": "tfc:blast_furnace",
      "name": "Доменная печь",
      "text": "Доменная печь с дымоходом минимальной высоты.",
      "enable_visualize": true
    },
    {
      "type": "patchouli:text",
      "text": "Дымоход доменной печи может состоять из пяти слоев - каждый слой требует четыре $(thing)Огнеупорных кирпичей$() и двенадцати $(thing)Кованых железных листов$(), для завершения строительства. Наличие большего количества слоев увеличивает общую вместимость доменной печи, позволяя плавить больше стали за один раз. Каждый слой дымохода (максимум - пять слоёв), позволяет доменной печи вмещать на четыре дополнительных предмета руды больше."
    },
    {
      "type": "patchouli:text",
      "text": "Чтобы использовать доменную печь, вы должны бросить предметы в верхнюю часть дымохода - для производства стали, вы должны добавить равное количество предметов $(thing)Железных руд$() и $(l:mechanics/flux)флюса$(). Подойдут любые железные руды или предметы, которые могут плавиться в $(thing)Чугун$(). Вам также нужно будет добавить $(l:mechanics/charcoal_pit)Древесный уголь$(), который будет расходоваться по мере работы доменной печи."
    },
    {
      "type": "patchouli:text",
      "text": "Использование доменной печи откроет интерфейс печи, показанный справа. В этом интерфейсе вы увидите индикаторы содержания руды и топлива доменной печи. В верхнем правом слоте должна находиться $(thing)Фурма$(), металлическая труба, используемая для направления воздуха в высокую печь, необходимая для достижения максимальных температур для плавки стали. Фурму можно выковать на $(l:mechanics/anvils)Наковальне$()."
    },
    {
      "type": "patchouli:image",
      "images": [
        "tfc:textures/gui/book/gui/blast_furnace.png"
      ],
      "text": "Интерфейс доменной печи",
      "border": false
    },
    {
      "type": "patchouli:text",
      "text": "Вам также понадобятся $(l:mechanics/bellows)Меха$(), чтобы доменная печь достигла температуры, при которой железо расплавится. Его можно установить на любой из четырех сторон доменной печи."
    },
    {
      "type": "patchouli:multiblock",
      "multiblock_id": "tfc:full_blast_furnace",
      "name": "",
      "text": "Доменная печь полного размера с прикрепленными мехами и тиглем.",
      "enable_visualize": true
    },
    {
      "type": "patchouli:text",
      "text": "Наконец, чтобы начать, зажгите доменную печь с помощью $(l:getting_started/firepit#firestarter)Примитивного огнива$() или $(thing)Стального огнива$(). Она начнет нагревать руды внутри. Убедитесь, что в доменной печи остаётся топливо, и используйте меха, чтобы нагнетать воздух в печь после того, как ее внутренняя температура достигнет максимума, который может выдать уголь. После нагрева руды внутри, она расплавится и превратится в $(l:mechanics/steel)Чугун$()."
    },
    {
      "type": "patchouli:text",
      "text": "Жидкий металл будет стекать в любой металлический контейнер для жидкости, установленный непосредственно под доменной печью, такой как $(l:mechanics/crucible)Тигель$(). Его можно отлить в формы для слитков из выходного слота тигля и переработать в $(l:mechanics/steel)Сталь$()."
    }
  ],
  "read_by_default": true
}