{
  "__comment__": "This file was automatically created by mcresources",
  "name": "Долото",
  "category": "tfc:mechanics",
  "icon": "tfc:metal/chisel/wrought_iron",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "Долота - это инструмент для создания декоративных форм других блоков, включая плиты и ступени. Чтобы начать, вам понадобится $(thing)Долото$() и любой тип $(thing)Молотка$(). Долота должны быть отлиты в формах или кованы на $(l:mechanics/anvils)Наковальне$(). Чтобы начать долбление, держите долото в основной руке и молоток во второй руке, и нацельтесь на блок в мире."
    },
    {
      "type": "patchouli:text",
      "text": "Если вы можете долбить этот блок, будет показан $(c)красный контур$() блока, который будет долблен, в зависимости от выбранного $(thing)Режима$() долота.$(br2)У долота есть три режима, которые можно переключать, используя $(item)$(k:tfc.key.cycle_chisel_mode)$(): $(thing)плита$(), $(thing)ступенька$() и $(thing)шлифовка$(). Индикатор вашего режима долота должен появиться рядом с панелью быстрого доступа."
    },
    {
      "type": "patchouli:text",
      "text": "Нажмите $(item)$(k:key.use)$(), чтобы превратить блок в форму, выделенную красным. Если вы выдолбили плиту, половина блока, который вы долбили, отвалится, и вы сможете ее подобрать. Измените ориентацию вашего игрока и мыши, чтобы изменить ориентацию выдолбленного блока. Как правило, ориентация выдолбленного блока будет такой же, как если бы вы разместили его в этой ориентации самостоятельно."
    },
    {
      "type": "patchouli:image",
      "images": [
        "tfc:textures/gui/book/tutorial/chisel_block.png",
        "tfc:textures/gui/book/tutorial/chisel_stair.png",
        "tfc:textures/gui/book/tutorial/chisel_slab.png"
      ],
      "text": "Три режима долота, используемых на блоке $(thing)сырого известняка$().",
      "border": true
    },
    {
      "type": "patchouli:crafting",
      "recipe": "tfc:crafting/rock/marble_smooth",
      "text": "Долото также может использоваться в некоторых рецептах крафта как сокращение для больших количеств."
    },
    {
      "type": "patchouli:text",
      "text": "Будьте осторожны! Работа долотом в шахте небезопасна. Каждый раз, когда вы используете долото, есть шанс $(l:mechanics/support_beams)обвала$()."
    }
  ],
  "read_by_default": true,
  "extra_recipe_mappings": {
    "tag:tfc:chisels": 0
  }
}