{
  "__comment__": "This file was automatically created by mcresources",
  "name": "Компостер",
  "category": "tfc:mechanics",
  "icon": "tfc:textures/gui/book/icons/composter.png",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "Компостер - это важный инструмент для изготовления удобрения. Для его работы требуются как $(2)Зеленые$(), так и $(4)Коричневые$() предметы. Разные предметы вносят разный вклад в количество производимого компоста. Чтобы добавить предмет, $(item)$(k:key.use)$(). Предметы, которые можно добавлять, описаны на следующих страницах."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "tfc:crafting/composter",
      "text": "Для изготовления компостера требуются лишь некоторые $(thing)Пиломатериалы$() и $(thing)Земля$()!"
    },
    {
      "type": "patchouli:text",
      "text": "Компостеры работают лучше в определенных условиях. Компостеры, на которых сверху лежит блок снега, работают немного быстрее. Компостеры в регионах с осадками менее 150 мм или более 350 мм работают гораздо медленнее, причем этот эффект усиливается ближе к максимальному и минимальному количеству осадков. Также компостеры, касающиеся других компостеров, работают медленнее."
    },
    {
      "type": "tfc:multimultiblock",
      "text": "Компостер на стадиях пустого, работающего и завершенного.",
      "multiblocks": [
        {
          "pattern": [
            [
              "X"
            ],
            [
              "0"
            ]
          ],
          "mapping": {
            "X": "tfc:composter[stage=0,type=normal]"
          }
        },
        {
          "pattern": [
            [
              "X"
            ],
            [
              "0"
            ]
          ],
          "mapping": {
            "X": "tfc:composter[stage=8,type=normal]"
          }
        },
        {
          "pattern": [
            [
              "X"
            ],
            [
              "0"
            ]
          ],
          "mapping": {
            "X": "tfc:composter[stage=8,type=ready]"
          }
        }
      ]
    },
    {
      "type": "patchouli:text",
      "text": "Компостеру требуется 12 дней для завершения в средних условиях. Когда он будет готов, он приобретет цвет похожий на землю, и из него будут исходить серые частицы. Компост затем можно извлечь с помощью $(item)$(k:key.use)$() и $(item)$(k:key.sneak)$() с пустой рукой. Добавление таких вещей, как $(c)мясо$() и $(c)кости$() в компост портит его, превращая в красноватый и вызывая появление отвратительных частиц. Гнилой компост можно удалить таким же образом, как и хороший. При использовании на культуре он мгновенно убивает её."
    },
    {
      "type": "patchouli:multiblock",
      "multiblock": {
        "pattern": [
          [
            "X"
          ],
          [
            "0"
          ]
        ],
        "mapping": {
          "X": "tfc:composter[stage=8,type=rotten]"
        }
      },
      "name": "Гнилой компост",
      "text": "Гнилой компостер.",
      "enable_visualize": false
    },
    {
      "type": "patchouli:spotlight",
      "item": "tag:tfc:compost_greens_low",
      "link_recipes": false,
      "text": "Некоторые $(2)зелёные$() предметы мало вносят в компостер, например, растения. Чтобы удовлетворить потребность компостера в зелёных предметах, вам понадобится 16 из них."
    },
    {
      "type": "patchouli:spotlight",
      "item": "tag:tfc:compost_greens",
      "link_recipes": false,
      "text": "Некоторые $(2)зелёные$() предметы вносят умеренное количество в компостер, например, зерновые. Чтобы удовлетворить потребность компостера в зелёных предметах, вам понадобится 8 из них."
    },
    {
      "type": "patchouli:spotlight",
      "item": "tag:tfc:compost_greens_high",
      "link_recipes": false,
      "text": "Некоторые $(2)зелёные$() предметы вносят большое количество в компостер, например, фрукты и овощи. Чтобы удовлетворить потребность компостера в зелёных предметах, вам понадобится 4 из них."
    },
    {
      "type": "patchouli:spotlight",
      "item": "tag:tfc:compost_browns_low",
      "link_recipes": false,
      "text": "Некоторые $(4)коричневые$() предметы мало вносят в компостер, например, высокие растения, такие как сухой фрагмит, древовидные папоротники и лозы, а также опавшие листья. Чтобы удовлетворить потребность компостера в коричневых предметах, вам понадобится 16 из них."
    },
    {
      "type": "patchouli:spotlight",
      "item": "tag:tfc:compost_browns",
      "link_recipes": false,
      "text": "Некоторые $(4)коричневые$() предметы вносят умеренное количество в компостер, например, древесная зола и джут. Чтобы удовлетворить потребность компостера в коричневых предметах, вам понадобится 8 из них."
    },
    {
      "type": "patchouli:spotlight",
      "item": "tag:tfc:compost_browns_high",
      "link_recipes": false,
      "text": "Некоторые $(4)коричневые$() предметы вносят большое количество в компостер, например, дыни, тыквы, мёртвая трава, шишки, гумус и дрейфовое дерево. Чтобы удовлетворить потребность компостера в коричневых предметах, вам понадобится 4 из них."
    },
    {
      "type": "patchouli:spotlight",
      "item": "tag:tfc:compost_poisons",
      "link_recipes": false,
      "text": "Некоторые предметы будут $(c)отравлять$() ваш компост. К ним относятся $(c)мясо$() и $(c)кости$(). Отравленный компост, используемый на культуре, мгновенно убивает её."
    }
  ],
  "read_by_default": true
}