{
  "__comment__": "This file was automatically created by mcresources",
  "name": "Домашние животные",
  "category": "tfc:mechanics",
  "icon": "minecraft:lead",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "$(thing)Домашние животные$() - это животные, которые функционируют очень похоже на $(l:mechanics/animal_husbandry)Домашний скот$(), но не дают полезных продуктов. Вместо этого они могут выполнять команды, следовать за вами дома, контролировать вредителей и помогать в охоте."
    },
    {
      "type": "patchouli:text",
      "text": "Домашние животные признают определенного игрока своим $(thing)Хозяином$(). Чтобы стать хозяином домашнего животного, нужно покормить его, чтобы повысить его привязанность выше 15%%. Домашние животные будут выполнять только те команды, которые исходят от их хозяина.$(br2)Клик по домашнему животному $(l:mechanics/dye)красителем$() меняет цвет его ошейника."
    },
    {
      "type": "patchouli:entity",
      "entity": "tfc:dog{NoAI:1b,birth:-100000000L,oldDay:9223372036854775807L,geneticSize:16}",
      "scale": 0.7,
      "text": "Собака."
    },
    {
      "type": "patchouli:text",
      "text": "Собаки - это домашние животные, которые едят зерновые, овощи и мясо, будь то испорченное или нет. Они помогут вам охотиться практически на любого наземного хищника или добычу."
    },
    {
      "type": "patchouli:entity",
      "entity": "tfc:cat{NoAI:1b,birth:-100000000L,oldDay:9223372036854775807L,geneticSize:16}",
      "scale": 0.7,
      "text": "Кот."
    },
    {
      "type": "patchouli:text",
      "text": "Коты - это домашние животные, которые едят зерновые, приготовленное мясо и молочные продукты. Они помогут вам охотиться на наземную добычу и мелкую рыбу. Дома они будут убивать вредителей без запроса. Коты не всегда слушаются, когда им говорят сидеть."
    },
    {
      "type": "patchouli:text",
      "text": "Ответственные владельцы домашних животных должны научиться контролировать своего питомца. К счастью, это легко. Нажимая $(item)$(k:key.use)$() при удержании $(item)$(k:key.sneak)$() с пустой рукой, можно открыть $(thing)Экран домашнего животного$(). Этот экран содержит ряд команд, которые можно использовать, чтобы сказать питомцу, что делать: $(thing)Расслабься$(), $(thing)Мы дома$(), $(thing)Сидеть$(), $(thing)Иди за мной$() и $(thing)Охоться со мной$()."
    },
    {
      "type": "patchouli:text",
      "text": "$(thing)Расслабься$() - это стандартное состояние домашних животных, и отдавая им команду, они возвращаются в это состояние. Если домашнее животное находится дома, оно будет бродить по территории, но не уйдет, и будет спать один раз в день. Если оно слишком далеко от дома, оно будет бесцельно ходить."
    },
    {
      "type": "patchouli:text",
      "text": "$(thing)Мы дома$() устанавливает домашнюю позицию для домашнего животного. Это говорит животному, что во время отдыха оно должно оставаться в этой общей области. Сообщение животному, что оно дома, не меняет его текущую активность.$(br2)$(thing)Сидеть$() говорит домашнему животному сесть там, где оно находится. Однако, у животных есть свои мысли, и они в конечном итоге заскучают и встанут!"
    },
    {
      "type": "patchouli:text",
      "text": "$(thing)Охоться со мной$() говорит домашнему животному следовать за вами и вступать в бой, когда вы атакуете или когда вас атакуют. Домашние животные будут атаковать только тех животных, на которых они могут напасть (например, коты не могут помочь атаковать медведей!).$(br2)$(thing)Иди за мной$() то же самое, что и охоться со мной, но домашнее животное не будет рисковать в бою."
    }
  ],
  "read_by_default": true
}