{
  "__comment__": "This file was automatically created by mcresources",
  "name": "Швейный стол",
  "category": "tfc:mechanics",
  "icon": "tfc:wood/sewing_table/oak",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "$(thing)Швейный стол$() используется для создания узоров для баннеров и шаблонов для кузнечного дела. Он требует $(l:mechanics/weaving#wool_cloth)шерстяную ткань$(), $(l:mechanics/weaving#burlap_cloth)джутовую ткань$(), нить или пряжу, а также иглу."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "tfc:crafting/bone_needle",
      "text": "Иглу для шитья можно сделать из кости."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "tfc:crafting/wood/sewing_table/oak",
      "text": "Швейный стол можно сделать из дерева, кожи и ножниц."
    },
    {
      "type": "patchouli:text",
      "text": "Инвентарь швейного стола похож на инвентарь верстака. Если вы допустите ошибку, просто выйдите из инвентаря, и ваши предметы вернутся к вам. В интерфейсе доступна книга рецептов. Выбор книги открывает меню, где можно выбрать рецепт. Это размещает небольшие указатели шагов, которые нужно выполнить на рабочей поверхности."
    },
    {
      "type": "patchouli:image",
      "images": [
        "tfc:textures/gui/book/gui/sewing_table.png"
      ],
      "text": "Экран шитья.",
      "border": true
    },
    {
      "type": "patchouli:text",
      "text": "Ячейки слева предназначены для нити и иглы. Две нижние ячейки могут содержать любую комбинацию джутовой и шерстяной ткани. Ячейка справа покажет результат, когда он будет готов. Взятие результата из ячейки результата завершает создание и использует предметы."
    },
    {
      "type": "patchouli:text",
      "text": "Одина ткань позволяет разместить 8 квадратов этого материала на швейной поверхности. Точно так же одна нить позволяет сделать 16 стежков. Когда вы выбрали рецепт, просто используйте кнопки в верхнем правом углу экрана, чтобы разместить квадраты и сшить их вместе, как показано в руководстве. Хотите убрать стежки? Используйте красную кнопку 'X', чтобы избавиться от квадратов."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "minecraft:loom",
      "text": "Ткацкий станок для создания вещей с узорами на баннерах можно создать для работы с узорами на баннерах."
    },
    {
      "type": "patchouli:text",
      "text": "Для информации о использовании шаблонов для кузнечного дела, смотрите главу $(l:mechanics/armor_trims)отделка брони$()."
    }
  ],
  "read_by_default": true
}