{
  "__comment__": "This file was automatically created by mcresources",
  "name": "Доменна піч",
  "category": "tfc:mechanics",
  "icon": "tfc:blast_furnace",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "$(thing)Доменна піч$() - це передовий пристрій, що використовується для виробництва $(thing)сталі$(). Суміш $(thing)залізної руди$(), $(thing)деревного вугілля$(), та $(thing)флюсу$(), у контрольованому пекельному середовищі, дає можливість створити міцніший матеріал за ковке залізо.$(br2)Щоб створити активний блок печі тобі знадобиться $(l:mechanics/crucible)тигель$() та багато $(thing)листів ковкого заліза$()."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "tfc:crafting/blast_furnace",
      "text": "Для виготовлення активного блоку доменної печі потрібен $(thing)тигель$(), та вісім $(thing)листів кованого заліза$()."
    },
    {
      "type": "patchouli:text",
      "text": "Потім тобі треба збудувати саму конструкцію - $(thing)димар$(). Димар будується з $(l:mechanics/fire_clay#fire_bricks)вогнетривкої глини$(), оскільки тільки вона може витримати високу температуру. Далі потрібно цей димар обшити $(thing)листами ковкого заліза$() для додаткового зміцнення всієї конструкції. За бажанням, або можливістю, конструкцію можна обшити навіть $(thing)сталевими листами$()."
    },
    {
      "type": "patchouli:multiblock",
      "multiblock_id": "tfc:blast_furnace",
      "name": "Доменна піч",
      "text": "Доменна піч з димарем мінімальної висоти",
      "enable_visualize": true
    },
    {
      "type": "patchouli:text",
      "text": "Димар може мати до п'яти шарів заввишки. Кожен шар повинен містити 4 блоки $(thing)вогнетривкої цегли$() та дванадцять $(thing)листів ковкого заліза$(). Наявність більшої кількості шарів збільшує загальну потужність доменної печі, дозволяючи їй виплавляти більше сталі одночасно. Кожен шар димової труби, щонайбільше п’ять, дозволяє доменній печі вміщувати чотири додаткові елементи руди."
    },
    {
      "type": "patchouli:text",
      "text": "Завантажувати елементи у піч треба через димар зверху, у отвір димаря.  $(thing)Залізну руду$() та $(l:mechanics/flux)флюс$() необхідно завантажувати у однаковій кількості. Будь-яка залізна руда, або предмети, що можуть перетворитися на $(thing)чавун$() можна використовувати. Також необхідно додати $(l:mechanics/charcoal_pit)деревне вугілля$() в достатній кількості. Воно буде витрачатись у процесі виробництва."
    },
    {
      "type": "patchouli:text",
      "text": "Інтерфейс блоку доменної печі показано праворуч. Тут є індикатори завантаження руди та палива у димарі. Верхній правий слот повинен містити $(thing)фурму$(), це металева труба, що дає можливість нагнітати повітря у активну частину печі. Повітря дозволяє підвищувати температуру, що потрібна для процесу виготовлення сталі. Фурму можна викувати на $(l:mechanics/anvils)ковадлі$()."
    },
    {
      "type": "patchouli:image",
      "images": [
        "tfc:textures/gui/book/gui/blast_furnace.png"
      ],
      "text": "Інтерфейс доменної печі",
      "border": false
    },
    {
      "type": "patchouli:text",
      "text": "Також, до блоку доменної печі потрібно встановити $(l:mechanics/bellows)міхи$(). Вони потрібні для нагнітання повітря у піч, щоб та могла підтримувати достатню температуру плавлення. Міхи можна розмістити на будь-якому з чотирьох боків доменної печі."
    },
    {
      "type": "patchouli:multiblock",
      "multiblock_id": "tfc:full_blast_furnace",
      "name": "",
      "text": "Доменна піч максимального розміру з тиглем та міхами",
      "enable_visualize": true
    },
    {
      "type": "patchouli:text",
      "text": "Щоб почати процес плавлення, піч треба запалити $(l:getting_started/firepit#firestarter)запальничкою$() або $(thing)кресалом$(). Руда всередині печі почне нагріватись. Переконайся, що в доменній печі залишається паливо, і використовуй міхи, щоб додати повітря в доменну піч після того, як її внутрішня температура досягне максимуму для деревного вугілля. Після того як руда всередині нагріється та розплавиться, вона перетвориться на $(l:mechanics/steel)чавун$()."
    },
    {
      "type": "patchouli:text",
      "text": "Рідкий чавун почне стікати у контейнер, що знаходиться під блоком доменної печі. Цим контейнером може бути $(l:mechanics/crucible)тигель$(). Білий чавун можна одразу виливати у глиняні форми для злитків. Злитки можна обробити, та отримати $(l:mechanics/steel)сталь$()."
    }
  ],
  "read_by_default": true
}