{
  "__comment__": "This file was automatically created by mcresources",
  "name": "Улюбленці",
  "category": "tfc:mechanics",
  "icon": "minecraft:lead",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "$(thing)Улюбленці$() - це тварини, що можна визнати $(l:mechanics/animal_husbandry)худобою$(), але вони не приносять корисних продуктів. Натомість вони можуть виконувати команди, стежити за вами по дому, контролювати шкідників та допомагати у полюванні."
    },
    {
      "type": "patchouli:text",
      "text": "Улюбленці визнають певного гравця своїм $(thing)власником$(). Щоб стати власником свого улюбленця, треба годувати його до підвищення прирученості, вище 15%%. Твій улюбленець буде слухати лише твої команди.$(br2)Клік по улюбленцю, з барвником у руці, змінює колір його нашийника."
    },
    {
      "type": "patchouli:entity",
      "entity": "tfc:dog{NoAI:1b,birth:-100000000L,oldDay:9223372036854775807L,geneticSize:16}",
      "scale": 0.7,
      "text": "Собака"
    },
    {
      "type": "patchouli:text",
      "text": "Собаки — домашня тварина, яка їсть зерно, овочі та м’ясо, тухле та свіже. Вони допоможуть тобі у полюванні на будь-якого наземного хижака чи здобич."
    },
    {
      "type": "patchouli:entity",
      "entity": "tfc:cat{NoAI:1b,birth:-100000000L,oldDay:9223372036854775807L,geneticSize:16}",
      "scale": 0.7,
      "text": "Кішка"
    },
    {
      "type": "patchouli:text",
      "text": "Кішки - це домашні тварини, які їдять зерно, варене м'ясо та молочні продукти. Вони допоможуть тобі полювати на наземну здобич та дрібну рибу. Перебуваючи вдома, вони вбиватимуть шкідників без запиту. Коти не завжди слухають команди сісти."
    },
    {
      "type": "patchouli:text",
      "text": "Відповідальний власник свого улюбленця повинен навчитися контролювати свого вихованця. На щастя, це легко. Натисканням $(item)$(k:key.use)$() утримуючи $(item)$(k:key.sneak)$() з порожньою рукою, відкриває $(thing)меню улюбленця$(). Цей екран містить кілька команд, які можна використовувати до свого вихованця: $(thing)відпочивати$(), $(thing)вдома$(), $(thing)сидіти$(), $(thing)йти за мною$(), та $(thing)полювати зі мною$()."
    },
    {
      "type": "patchouli:text",
      "text": "$(thing)Відпочивати$() - є звичайним станом домашніх тварин, і команда повертає їх до цього стану. Якщо закомандувати вдома, він буде бродити по території, але не залишати, і спати раз на день. Якщо він занадто далеко від дому, він буде ходити безцільно."
    },
    {
      "type": "patchouli:text",
      "text": "$(thing)Вдома$() - встановлює вихідне положення вихованця. Це говорить тварині, що вона повинна розслабитись, залишатися в цій загальній зоні. Якщо скомандувати тварині, що вона вдома - це не змінить активності, якою вона зараз займається.$(br2)$(thing)Сидіти$() - вкаже вихованцеві сісти на місце. Однак тварини мають власний розум, і з часом їм стане нудно, і вони встануть!"
    },
    {
      "type": "patchouli:text",
      "text": "$(thing)Полювати зі мною$() - вкаже вихованцеві слідувати за тобою, та брати участь у бою, коли ти атакуєш, або тебе атакують. Улюбленці нападають лише на тих тварин, на яких вони здатні (наприклад, коти не можуть допомогти напасти на ведмедя!).$(br2)$(thing)Слідувати за мною$() - те саме, що і полювати, але вихованець не буде ризикувати собою в бою."
    }
  ],
  "read_by_default": true
}